/*
//-------------------------------------------------------------------------------------------------
作成日：2026/01/20 Tue 18:19
作者　：菅村

Slide.cs
障害物を左右に動かす為のスクリプト。
//-------------------------------------------------------------------------------------------------
 */


//-------------------------------------------------------------------------------------------------
// 名前空間の宣言。
//-------------------------------------------------------------------------------------------------
using UnityEngine;


//-------------------------------------------------------------------------------------------------
// class 
//-------------------------------------------------------------------------------------------------
public class Rotate : MonoBehaviour
{
    //-------------------------------------------------------------------------------------------------
    // 変数宣言。
    //-------------------------------------------------------------------------------------------------

    // オブジェクトの移動タイプ。
    [System.Serializable]
    enum MoveType
    {
        UNMOVE,                     // 動かない。
        GOLDEN_ROTATIONAL_ENERGY,   // 回転。
    }

    [Header("オブジェクトの移動タイプ")]
    [SerializeField] private MoveType _type;

    [Header("オブジェクトの移動スピード")]
    [SerializeField] private float _sideMoveSpeed       = 1f;
    [SerializeField] private float _verticalMoveSpeed   = 1f;

    // 
    private Vector3 _pos = Vector3.zero;

    //
    private Quaternion _rotate = Quaternion.identity;

    // 
    private float sin = 0;


    //-------------------------------------------------------------------------------------------------
    // private void Awake()関数。
    //-------------------------------------------------------------------------------------------------
    private void Awake()
    {
        _pos    = this.transform.localPosition;
        _rotate = this.transform.localRotation;
    }


    /*

    //-------------------------------------------------------------------------------------------------
    // private void Start()関数。
    //-------------------------------------------------------------------------------------------------
    private void Start()
    {
        
    }

    */


    //-------------------------------------------------------------------------------------------------
    // private void Update()関数。
    //-------------------------------------------------------------------------------------------------
    private void Update()
    {
        switch ( _type )
        {
            case MoveType.UNMOVE:
                break;

            case MoveType.GOLDEN_ROTATIONAL_ENERGY:
                sin = Mathf.Tan( Time.time * 2f );
                this.transform.localRotation = new Quaternion( _rotate.x, _rotate.y, sin + _rotate.z, _rotate.w );

                //this.transform.localPosition = new Vector3(sin + _pos.x, sin + _pos.y, _pos.z);
                break;

            default:
                break;
        }
    }
}